Revit 2025 API
PageOrientationType Enumeration
 An enumerated type listing all Page Orientation types of Print Setting
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PageOrientationType
Public Enumeration PageOrientationType
public enum class PageOrientationType
type PageOrientationType
Members
Member name | Value | Description
Portrait | 0 |  The type of Page Orientation is Portrait
Landscape | 1 |  The type of Page Orientation is Landscape
Auto | 2 |  Auto Page Orientation
See Also
Reference
Autodesk.Revit.DB Namespace